Тест_ЗУП_31_КОРП/src/Catalogs/СодержаниеЭлектронныхКурсов/СодержаниеЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеЭлектронныхКурсов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭлектронныеКурсы</owners>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТеорияЭлектронныхКурсов</types>
      <types>CatalogRef.УдалитьТекстыЭлектронныхКурсов</types>
      <types>CatalogRef.ЭлектронныеГлоссарии</types>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
      <types>CatalogRef.ЭлектронныеТесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлемента</name>
    <type>
      <types>EnumRef.ТипыЭлементовСодержанияЭлектронногоКурса</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ТипыЭлементовСодержанияЭлектронногоКурса/ТипыЭлементовСодержанияЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовСодержанияЭлектронногоКурса</name>
  <enumValues>
    <name>Начало</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>Видео</name>
  </enumValues>
  <enumValues>
    <name>Звук</name>
  </enumValues>
  <enumValues>
    <name>СлайдПрезентации</name>
  </enumValues>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>ДокументWord</name>
  </enumValues>
  <enumValues>
    <name>Глоссарий</name>
  </enumValues>
  <enumValues>
    <name>Финальный</name>
  </enumValues>
  <enumValues>
    <name>YouTube</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>SCO</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ИзучениеЭлектронногоКурса/ИзучениеЭлектронногоКурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзучениеЭлектронногоКурса</name>
  <registerRecords>InformationRegister.ПопыткиИзученияЭлементовЭлектронныхКурсов</registerRecords>
  <registerRecords>InformationRegister.ЭлектронныеТестыНаПроверку</registerRecords>
  <registerRecords>InformationRegister.ОтветыНаТестовыеВопросы</registerRecords>
  <registerRecords>InformationRegister.ИзученныеЭлектронныеКурсы</registerRecords>
  <registerRecords>InformationRegister.ВыбранныеВариантыОтветовЭлектронныхВопросов</registerRecords>
  <registerRecords>InformationRegister.ИзученныеЭлементыЭлектронныхКурсов</registerRecords>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>DefinedType.КонтекстЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>DefinedType.УчащийсяЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйКурс</name>
    <type>
      <types>CatalogRef.ЭлектронныеКурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИзучения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматИсходныхДанных</name>
    <type>
      <types>EnumRef.ФорматыДанныхЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоТестовоеИзучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоРежимРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПопыткиИзучения</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПопытки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Catalogs/СодержаниеЭлектронныхКурсов/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура Перезаписать(ЭлементСодержания) Экспорт

	ОбъектЭлементСодержания =  ЭлементСодержания.ПолучитьОбъект();
	// Наименование будет обновлено в обработчике ПередЗаписью модуля объекта

	ОбъектЭлементСодержания.Записать();
			
КонецПроцедуры

Функция ТипЭлементаПоСсылке(СсылкаНаЭлемент, ЭтоГруппа) Экспорт
	
	Если ЭтоГруппа Тогда		
		Возврат Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Группа;		
	Иначе		
		ВызватьИсключение НСтр("ru = 'Тип элемента содержания не определен'");		
	КонецЕсли;	
	
КонецФункции

Функция ДобавитьЭлементСодержания(ЭлектронныйКурс, СсылкаНаЭлемент, Группа, ЭтоГруппа = Ложь, Наименование = Неопределено, ТипЭлемента = Неопределено) Экспорт
	Возврат Справочники.ЭлектронныеКурсы.ДобавитьЭлементСодержания(ЭлектронныйКурс, СсылкаНаЭлемент, Группа, ЭтоГруппа, Наименование, ТипЭлемента);
КонецФункции

Процедура УстановитьСнятьПометкуУдаленияПодчиненныхЭлементов(Знач ЭлементСодержания, Знач ПометкаУдаления, Знач ЭлектронныйКурс = Неопределено) Экспорт
	
	Если ЭлектронныйКурс = Неопределено Тогда
		ЭлектронныйКурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Владелец");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
	
		// Подчиненные элементы
		
		ПодчиненныеЭлементы = РазработкаЭлектронныхКурсовСлужебный.ВсеСсылкиЭлементаСправочника(ЭлементСодержания, Истина);
		
		Для каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
		
			Если ТипЗнч(ПодчиненныйЭлемент) = Тип("СправочникСсылка.ПоставщикиЭлектронныхКурсов") Тогда
				Продолжить; // поставщика курса не удаляем
			КонецЕсли;			
			
			ПодчиненныйЭлементОбъект  = ПодчиненныйЭлемент.ПолучитьОбъект();
			ПодчиненныйЭлементОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
		
		КонецЦикла;		
		
		// Статистика изучения

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзучениеЭлектронногоКурса.Ссылка КАК Ссылка,
			|	ИзучениеЭлектронногоКурса.Учащийся КАК Учащийся
			|ИЗ
			|	Документ.ИзучениеЭлектронногоКурса КАК ИзучениеЭлектронногоКурса
			|ГДЕ
			|	ИзучениеЭлектронногоКурса.ЭлектронныйКурс = &ЭлектронныйКурс
			|	И ИзучениеЭлектронногоКурса.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Учащийся) Тогда
				Продолжить; // Для совместимости с 3.1, где были тестовые документы
			КонецЕсли;			
			ИзучениеЭлектронногоКурсаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ИзучениеЭлектронногоКурсаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
		
	Исключение
 
 		ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
		
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
